# Pandas

## Pandas Series

In [144]:
import numpy as np
import pandas as pd
import seaborn as sns
import math

In [145]:
pd.Series([1,2,3,4])

0    1
1    2
2    3
3    4
dtype: int64

In [146]:
series = pd.Series([1,2,3,4])
type(series)

pandas.core.series.Series

In [147]:
series.axes

[RangeIndex(start=0, stop=4, step=1)]

In [148]:
series.dtype

dtype('int64')

In [149]:
series.empty

False

In [150]:
series.ndim

1

In [151]:
series.size

4

In [152]:
series.values

array([1, 2, 3, 4], dtype=int64)

In [153]:
series[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [154]:
series.head(2)

0    1
1    2
dtype: int64

In [155]:
series.tail(2)

2    3
3    4
dtype: int64

In [156]:
a=np.array([1,2,3,55,77,888])
a

array([  1,   2,   3,  55,  77, 888])

In [157]:
series = pd.Series(a)
series

0      1
1      2
2      3
3     55
4     77
5    888
dtype: int32

In [158]:
series.index

RangeIndex(start=0, stop=6, step=1)

In [159]:
pd.Series([1,5,0.8,34], index=[1,3,5,7])

1     1.0
3     5.0
5     0.8
7    34.0
dtype: float64

In [160]:
series = pd.Series([1,2,3,66,88,9,0.3], index=['a','b','c','d','e','f','g'])

In [161]:
series['g']

0.3

In [162]:
dictionary = {'reg':10, 'log':11, 'cart':12}
dictionary

{'reg': 10, 'log': 11, 'cart': 12}

In [163]:
series =pd.Series(dictionary)

In [164]:
series['reg']

10

In [165]:
series['log':'cart']

log     11
cart    12
dtype: int64

In [166]:
pd.concat([series,series])

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [167]:
series.append(series)

reg     10
log     11
cart    12
reg     10
log     11
cart    12
dtype: int64

In [168]:
series

reg     10
log     11
cart    12
dtype: int64

## Index Operations

In [169]:
series = pd.Series([1,2,3,4,5,66,77])
series

0     1
1     2
2     3
3     4
4     5
5    66
6    77
dtype: int64

In [170]:
series.keys

<bound method Series.keys of 0     1
1     2
2     3
3     4
4     5
5    66
6    77
dtype: int64>

In [171]:
list(series.items())

[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 66), (6, 77)]

In [172]:
series.values

array([ 1,  2,  3,  4,  5, 66, 77], dtype=int64)

In [173]:
5 in series

True

In [174]:
series[[4,5]]

4     5
5    66
dtype: int64

In [175]:
series =pd.Series(dictionary)
series

reg     10
log     11
cart    12
dtype: int64

In [176]:
series['reg':'cart']

reg     10
log     11
cart    12
dtype: int64

In [177]:
series[(series>10) & (series<12)]

log    11
dtype: int64

In [178]:
data = pd.Series(['a','b','c'], index = [1,3,5])
data

1    a
3    b
5    c
dtype: object

In [179]:
data[1] # data[0] will gives error

'a'

In [180]:
data[0:3]

1    a
3    b
5    c
dtype: object

In [181]:
data.loc[5]

'c'

In [182]:
data.loc[0:4] # label based indexing location

1    a
3    b
dtype: object

In [183]:
data.iloc[0] # positional indexing, iloc catch by resetting index

'a'

## Pandas Dataframe

In [184]:
l = [1,4,577,343]
l

[1, 4, 577, 343]

In [185]:
data = pd.DataFrame(l, columns=['values'])
type(data)

pandas.core.frame.DataFrame

In [186]:
data.axes

[RangeIndex(start=0, stop=4, step=1), Index(['values'], dtype='object')]

In [187]:
data.shape

(4, 1)

In [188]:
data.ndim

2

In [189]:
data.values

array([[  1],
       [  4],
       [577],
       [343]], dtype=int64)

In [190]:
data.head(2)

   values
0       1
1       4

In [191]:
data.tail(2)

   values
2     577
3     343

In [192]:
a=np.array([1,2,3,4,566])
type(a)

numpy.ndarray

In [193]:
pd.DataFrame(a,columns=['values'])

   values
0       1
1       2
2       3
3       4
4     566

In [194]:
v = np.arange(1,10).reshape(3,3)
v

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [195]:
data=pd.DataFrame(v,columns=['v1','v2','v3'])
data

   v1  v2  v3
0   1   2   3
1   4   5   6
2   7   8   9

In [196]:
data.columns=('value1','value2','value3')
data

   value1  value2  value3
0       1       2       3
1       4       5       6
2       7       8       9

In [197]:
data=pd.DataFrame(v,columns=['v1','v2','v3'], index=['a','b','c'])
data

   v1  v2  v3
a   1   2   3
b   4   5   6
c   7   8   9

In [198]:
pd.DataFrame(pd.Series([1,2,3,4]),columns=['variable'])

   variable
0         1
1         2
2         3
3         4

In [199]:
a = pd.Series([1,2,3,4])
b = pd.Series([1,2,3,4])

In [200]:
pd.DataFrame({'variable1':a,
              'variable2':b})

   variable1  variable2
0          1          1
1          2          2
2          3          3
3          4          4

In [201]:
dict_ = {
    'reg':{'RMSE':101,
           'MSE':111,
           'SSE':121},
    'log':{'RMSE':102,
           'MSE':112,
           'SSE':122},
    'cart':{'RMSE':103,
           'MSE':113,
           'SSE':123},
}

In [202]:
pd.DataFrame(dict_)

      reg  log  cart
RMSE  101  102   103
MSE   111  112   113
SSE   121  122   123

In [203]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)
df = pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df

   var1  var2  var3
0     3     1     2
1     6     2     8
2     6     9     5
3     0     3     2
4     5     4     1

In [204]:
df[0:1]

   var1  var2  var3
0     3     1     2

In [205]:
df.index=['a','b','c','d','e']

In [206]:
df['c':'e']

   var1  var2  var3
c     6     9     5
d     0     3     2
e     5     4     1

In [207]:
df.drop('a', axis=0, inplace=True)

In [208]:
df

   var1  var2  var3
b     6     2     8
c     6     9     5
d     0     3     2
e     5     4     1

In [209]:
l = ['b','c']

In [210]:
l

['b', 'c']

In [211]:
df.drop(l,axis=0)

   var1  var2  var3
d     0     3     2
e     5     4     1

In [212]:
'var1' in df

True

In [213]:
l = ['var1','var2','var7']

In [214]:
for i in l:
    print(i in df)

True
True
False

In [215]:
df['var1'] is df['var2']

False

In [216]:
df['var1'] # dictionary type choice

b    6
c    6
d    0
e    5
Name: var1, dtype: int32

In [217]:
df.var1 # attribute type choice

b    6
c    6
d    0
e    5
Name: var1, dtype: int32

In [218]:
df[['var1','var2']]

   var1  var2
b     6     2
c     6     9
d     0     3
e     5     4

In [219]:
l = ['var1','var2']
df[l]

   var1  var2
b     6     2
c     6     9
d     0     3
e     5     4

In [220]:
df['added_column'] = df['var1'] / df['var2']
df

   var1  var2  var3  added_column
b     6     2     8      3.000000
c     6     9     5      0.666667
d     0     3     2      0.000000
e     5     4     1      1.250000

In [221]:
df.drop('c',axis=0, inplace=True)

In [222]:
df

   var1  var2  var3  added_column
b     6     2     8          3.00
d     0     3     2          0.00
e     5     4     1          1.25

In [223]:
df.drop('var1', axis=1, inplace=True)

In [224]:
df

   var2  var3  added_column
b     2     8          3.00
d     3     2          0.00
e     4     1          1.25

## Reach to observations and variables

In [225]:
df

   var2  var3  added_column
b     2     8          3.00
d     3     2          0.00
e     4     1          1.25

In [226]:
df.iloc[:3]

   var2  var3  added_column
b     2     8          3.00
d     3     2          0.00
e     4     1          1.25

In [227]:
df.iloc[:2, :2]

   var2  var3
b     2     8
d     3     2

In [228]:
df['var3']

b    8
d    2
e    1
Name: var3, dtype: int32

In [229]:
df.loc[:'e', 'var3']

b    8
d    2
e    1
Name: var3, dtype: int32

In [230]:
df[df.var3 > 4]['var2']

b    2
Name: var2, dtype: int32

In [231]:
df[(df.var3 > 3 & (df.var3 < 2))]['var2'] # conditional index operations

b    2
d    3
Name: var2, dtype: int32

In [232]:
df.loc[df.var2 > 3, ['added_column']]

   added_column
e          1.25

## Merge - Join Operations

In [233]:
s1 = np.random.randint(10,size=5)
s2 = np.random.randint(10,size=5)
s3 = np.random.randint(10,size=5)
df = pd.DataFrame({'var1':s1,'var2':s2,'var3':s3})
df

   var1  var2  var3
0     8     0     5
1     8     6     8
2     6     4     2
3     9     7     0
4     7     4     2

In [234]:
df2 = df+99
df2

   var1  var2  var3
0   107    99   104
1   107   105   107
2   105   103   101
3   108   106    99
4   106   103   101

In [235]:
pd.concat([df,df2], axis=0)

   var1  var2  var3
0     8     0     5
1     8     6     8
2     6     4     2
3     9     7     0
4     7     4     2
0   107    99   104
1   107   105   107
2   105   103   101
3   108   106    99
4   106   103   101

In [236]:
pd.concat([df,df2], axis=0, ignore_index=True)

   var1  var2  var3
0     8     0     5
1     8     6     8
2     6     4     2
3     9     7     0
4     7     4     2
5   107    99   104
6   107   105   107
7   105   103   101
8   108   106    99
9   106   103   101

In [237]:
df2.columns= ['var1','var2','v3']
df2

   var1  var2   v3
0   107    99  104
1   107   105  107
2   105   103  101
3   108   106   99
4   106   103  101

In [238]:
pd.concat([df,df2], axis=0, ignore_index=True)

C:\Users\berka\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

      v3  var1  var2  var3
0    NaN     8     0   5.0
1    NaN     8     6   8.0
2    NaN     6     4   2.0
3    NaN     9     7   0.0
4    NaN     7     4   2.0
5  104.0   107    99   NaN
6  107.0   107   105   NaN
7  101.0   105   103   NaN
8   99.0   108   106   NaN
9  101.0   106   103   NaN

In [239]:
pd.concat([df,df2], axis=0, join='inner')

   var1  var2
0     8     0
1     8     6
2     6     4
3     9     7
4     7     4
0   107    99
1   107   105
2   105   103
3   108   106
4   106   103

In [240]:
pd.concat([df,df2], join_axes=[df.columns])

C:\Users\berka\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0     8     0   5.0
1     8     6   8.0
2     6     4   2.0
3     9     7   0.0
4     7     4   2.0
0   107    99   NaN
1   107   105   NaN
2   105   103   NaN
3   108   106   NaN
4   106   103   NaN

In [241]:
df1 = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'grup': ['Muhasebe', 'Muhendislik', 'Muhendislik', 'İK']})

df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [242]:
df2 = pd.DataFrame({'calisanlar': ['Ayse', 'Ali', 'Veli', 'Fatma'],
                    'ilk_giris': [2010, 2009, 2014, 2019]})

df2

  calisanlar  ilk_giris
0       Ayse       2010
1        Ali       2009
2       Veli       2014
3      Fatma       2019

In [243]:
pd.merge(df1, df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [244]:
pd.merge(df1, df2, on = 'calisanlar')

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [245]:
df3 = pd.merge(df1,df2)
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [246]:
df4 = pd.DataFrame({'grup': ['Muhasebe', 'Muhendislik', 'İK'],
                    'mudur': ['Caner', 'Mustafa', 'Berkcan']})

df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           İK  Berkcan

In [247]:
pd.merge(df3,df4)

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2009    Caner
1       Veli  Muhendislik       2014  Mustafa
2       Ayse  Muhendislik       2010  Mustafa
3      Fatma           İK       2019  Berkcan

In [248]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [249]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2009
1       Veli  Muhendislik       2014
2       Ayse  Muhendislik       2010
3      Fatma           İK       2019

In [250]:
pd.merge(df3,df5)

  calisanlar         grup  ilk_giris yetenekler
0        Ali     Muhasebe       2009  matematik
1        Ali     Muhasebe       2009      excel
2       Veli  Muhendislik       2014    kodlama
3       Veli  Muhendislik       2014      linux
4       Ayse  Muhendislik       2010    kodlama
5       Ayse  Muhendislik       2010      linux
6      Fatma           İK       2019      excel
7      Fatma           İK       2019    yonetim

In [251]:
df5 = pd.DataFrame({'grup': ['Muhasebe', 'Muhasebe',
                              'Muhendislik', 'Muhendislik', 'İK', 'İK'],
                    'yetenekler': ['matematik', 'excel', 'kodlama', 'linux',
                               'excel', 'yonetim']})

df5

          grup yetenekler
0     Muhasebe  matematik
1     Muhasebe      excel
2  Muhendislik    kodlama
3  Muhendislik      linux
4           İK      excel
5           İK    yonetim

In [252]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [253]:
pd.merge(df1,df5)

  calisanlar         grup yetenekler
0        Ali     Muhasebe  matematik
1        Ali     Muhasebe      excel
2       Veli  Muhendislik    kodlama
3       Veli  Muhendislik      linux
4       Ayse  Muhendislik    kodlama
5       Ayse  Muhendislik      linux
6      Fatma           İK      excel
7      Fatma           İK    yonetim

In [254]:
df3 = pd.DataFrame({'name': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'maas': [70000, 80000, 120000, 90000]})

df3

    name    maas
0    Ali   70000
1   Veli   80000
2   Ayse  120000
3  Fatma   90000

In [255]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           İK

In [256]:
pd.merge(df1,df3, left_on='calisanlar', right_on='name').drop('calisanlar', axis=1)

          grup   name    maas
0     Muhasebe    Ali   70000
1  Muhendislik   Veli   80000
2  Muhendislik   Ayse  120000
3           İK  Fatma   90000

In [257]:
df3a = df3.set_index('name')
df3a

         maas
name
Ali     70000
Veli    80000
Ayse   120000
Fatma   90000

In [258]:
df3a.shape

(4, 1)

In [259]:
df2a = df2.set_index('calisanlar')
df2a

            ilk_giris
calisanlar
Ayse             2010
Ali              2009
Veli             2014
Fatma            2019

In [260]:
pd.merge(df3a, df2a, left_index=True, right_index=True) # intersection df3a<>df2a (there is none)

         maas  ilk_giris
Ali     70000       2009
Veli    80000       2014
Ayse   120000       2010
Fatma   90000       2019

In [261]:
df3a.join(df2a)

         maas  ilk_giris
name
Ali     70000       2009
Veli    80000       2014
Ayse   120000       2010
Fatma   90000       2019

In [262]:
dfa = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [1, 2, 3, 4]})

dfa

  calisanlar  siralama
0        Ali         1
1       Veli         2
2       Ayse         3
3      Fatma         4

In [263]:
dfb = pd.DataFrame({'calisanlar': ['Ali', 'Veli', 'Ayse', 'Fatma'],
                    'siralama': [3, 1, 4, 2]})

dfb

  calisanlar  siralama
0        Ali         3
1       Veli         1
2       Ayse         4
3      Fatma         2

In [264]:
pd.merge(dfa, dfb, on = 'calisanlar')

  calisanlar  siralama_x  siralama_y
0        Ali           1           3
1       Veli           2           1
2       Ayse           3           4
3      Fatma           4           2

In [265]:
pd.merge(dfa, dfb, on = 'calisanlar', suffixes=['Salary','Experience'])

  calisanlar  siralamaSalary  siralamaExperience
0        Ali               1                   3
1       Veli               2                   1
2       Ayse               3                   4
3      Fatma               4                   2

## Aggregation and Grouping Operations

In [266]:
df = sns.load_dataset('planets')

In [267]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [268]:
df.shape

(1035, 6)

In [269]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [270]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

In [271]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'veri': [10,11,52,23,43,55]}, columns=['gruplar', 'veri'])
df

  gruplar  veri
0       A    10
1       B    11
2       C    52
3       A    23
4       B    43
5       C    55

In [272]:
df.groupby('gruplar').sum()

         veri
gruplar
A          33
B          54
C         107

In [273]:
df = sns.load_dataset('planets')

In [274]:
df.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [275]:
df.groupby('method')['orbital_period'].describe().T

method,Astrometry,Eclipse Timing Variations,Imaging,Microlensing,Orbital Brightness Modulation,Pulsar Timing,Pulsation Timing Variations,Radial Velocity,Transit,Transit Timing Variations
count,2.000000,9.000000,12.000000,7.000000,3.000000,5.000000,1.0,553.00000,397.000000,3.000000
mean,631.180000,4751.644444,118247.737500,3153.571429,0.709307,7343.021201,1170.0,823.35468,21.102073,79.783500
std,544.217663,2499.130945,213978.177277,1113.166333,0.725493,16313.265573,NaN,1454.92621,46.185893,71.599884
min,246.360000,1916.250000,4639.150000,1825.000000,0.240104,0.090706,1170.0,0.73654,0.355000,22.339500
25%,438.770000,2900.000000,8343.900000,2375.000000,0.291496,25.262000,1170.0,38.02100,3.160630,39.675250
50%,631.180000,4343.500000,27500.000000,3300.000000,0.342887,66.541900,1170.0,360.20000,5.714932,57.011000
75%,823.590000,5767.000000,94250.000000,3550.000000,0.943908,98.211400,1170.0,982.00000,16.145700,108.505500
max,1016.000000,10220.000000,730000.000000,5100.000000,1.544929,36525.000000,1170.0,17337.50000,331.600590,160.000000

## Aggregate, filter, transform, apply

In [276]:
df = pd.DataFrame({'gruplar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'degisken1': [10,23,33,22,11,99],
                   'degisken2': [100,253,333,262,111,969]},
                   columns = ['gruplar', 'degisken1', 'degisken2'])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [277]:
df.groupby('gruplar').aggregate([min, np.median, max])

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [278]:
df.groupby('gruplar').aggregate({'degisken1': min, 'degisken2': max})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [279]:
def filter_func(x):
    return x['degisken1'].std() > 9.5

In [280]:
df.groupby('gruplar').filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [281]:
df.groupby('gruplar').transform(lambda x: x-x.mean())

   degisken1  degisken2
0       -6.0      -81.0
1        6.0       71.0
2      -33.0     -318.0
3        6.0       81.0
4       -6.0      -71.0
5       33.0      318.0

In [282]:
df.groupby('gruplar').apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [283]:
df.groupby('gruplar').apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

In [284]:
L = [0,1,0,1,2,0]

In [285]:
df.groupby(L).sum()

   degisken1  degisken2
0        142       1402
1         45        515
2         11        111

## Pivot Tables

In [286]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [287]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [288]:
df.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [289]:
df.groupby(['sex','class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [290]:
df.pivot_table('survived', index='sex', columns='class') # this is simple method by groupby

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [291]:
df.pivot_table('survived', index='sex', columns='class', margins = True) # pivot with margins(All summations)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [292]:
age = pd.cut(df['age'], [0,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(0, 18] < (18, 90]]

In [293]:
df.pivot_table('survived', ['sex',age], 'class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663

In [294]:
fare = pd.qcut(df['fare'],2) # quantile qut
fare.head()

0     (-0.001, 14.454]
1    (14.454, 512.329]
2     (-0.001, 14.454]
3    (14.454, 512.329]
4     (-0.001, 14.454]
Name: fare, dtype: category
Categories (2, interval[float64]): [(-0.001, 14.454] < (14.454, 512.329]]

In [295]:
df.pivot_table('survived', ['sex',age], [fare, 'class'])

fare            (-0.001, 14.454]                     (14.454, 512.329]  \
class                      First    Second     Third             First
sex    age
female (0, 18]               NaN  1.000000  0.714286          0.909091
       (18, 90]              NaN  0.880000  0.444444          0.972973
male   (0, 18]               NaN  0.000000  0.260870          0.800000
       (18, 90]              0.0  0.098039  0.125000          0.391304

fare
class              Second     Third
sex    age
female (0, 18]   1.000000  0.318182
       (18, 90]  0.914286  0.391304
male   (0, 18]   0.818182  0.178571
       (18, 90]  0.030303  0.192308

In [296]:
df.pivot_table(index = 'sex', columns = 'class', aggfunc = {'survived':sum, 'fare':'mean'})

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

## R-Dplyr Style Data Manipulation

In [297]:
# !pip install dfply
from dfply import *

In [298]:
df = diamonds.copy()
df.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [299]:
df >> head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [300]:
# df >>= head()
df

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53935   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53936   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53937   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53938   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53939   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53940 rows x 10 columns]

In [301]:
df >> select(X.carat, X.cut) >> head()

   carat      cut
0   0.23    Ideal
1   0.21  Premium
2   0.23     Good
3   0.29  Premium
4   0.31     Good

In [302]:
df >> select(1, X.price, ['x','y']) >> head(3)

       cut  price     x     y
0    Ideal    326  3.95  3.98
1  Premium    326  3.89  3.84
2     Good    327  4.05  4.07

In [303]:
df >> select(starts_with('c')) >> head()

   carat      cut color clarity
0   0.23    Ideal     E     SI2
1   0.21  Premium     E     SI1
2   0.23     Good     E     VS1
3   0.29  Premium     I     VS2
4   0.31     Good     J     SI2

In [304]:
df >> select(contains('y')) >> head(3) # shows any y in any feature

  clarity     y
0     SI2  3.98
1     SI1  3.84
2     VS1  4.07

In [305]:
df >> select(columns_between('cut','table')) >> head(3)

       cut color clarity  depth  table
0    Ideal     E     SI2   61.5   55.0
1  Premium     E     SI1   59.8   61.0
2     Good     E     VS1   56.9   65.0

In [306]:
df >> drop(1, X.price, ['x','y']) >> head(3)

   carat color clarity  depth  table     z
0   0.23     E     SI2   61.5   55.0  2.43
1   0.21     E     SI1   59.8   61.0  2.31
2   0.23     E     VS1   56.9   65.0  2.31

In [307]:
df >> select(~X.carat, ~X.color) >> head()

       cut clarity  depth  table  price     x     y     z
0    Ideal     SI2   61.5   55.0    326  3.95  3.98  2.43
1  Premium     SI1   59.8   61.0    326  3.89  3.84  2.31
2     Good     VS1   56.9   65.0    327  4.05  4.07  2.31
3  Premium     VS2   62.4   58.0    334  4.20  4.23  2.63
4     Good     SI2   63.3   58.0    335  4.34  4.35  2.75

In [308]:
df >> row_slice([10,15])

    carat      cut color clarity  depth  table  price     x     y     z
10   0.30     Good     J     SI1   64.0   55.0    339  4.25  4.28  2.73
15   0.32  Premium     E      I1   60.9   58.0    345  4.38  4.42  2.68

In [309]:
df >> group_by('cut') >> row_slice(5)

     carat        cut color clarity  depth  table  price     x     y     z
128   0.91       Fair     H     SI2   64.4   57.0   2763  6.11  6.09  3.93
20    0.30       Good     I     SI2   63.3   56.0    351  4.26  4.30  2.71
40    0.33      Ideal     I     SI2   61.2   56.0    403  4.49  4.50  2.75
26    0.24    Premium     I     VS1   62.5   57.0    355  3.97  3.94  2.47
21    0.23  Very Good     E     VS2   63.8   55.0    352  3.85  3.92  2.48

In [310]:
df >> sample(n=15, replace = False)

       carat        cut color clarity  depth  table  price     x     y     z
10877   1.05    Premium     F     SI1   62.8   59.0   4879  6.43  6.40  4.03
30059   0.41    Premium     G     SI1   60.3   59.0    719  4.76  4.79  2.88
45707   0.56      Ideal     H     VS1   62.8   56.0   1698  5.28  5.23  3.30
40435   0.55       Good     E     SI1   63.3   54.0   1138  5.21  5.24  3.31
13663   1.01  Very Good     H     VS1   62.0   60.0   5593  6.43  6.38  3.97
9353    1.07    Premium     G     SI2   62.1   59.0   4584  6.54  6.48  4.04
34779   0.41    Premium     D     SI2   61.9   58.0    876  4.73  4.71  2.92
19707   0.28       Good     E     VS2   63.7   60.0    625  4.23  4.18  2.68
620     0.77  Very Good     H     VS1   61.0   60.0   2840  5.90  5.87  3.59
53031   1.01    Premium     J      I1   60.7   59.0   2602  6.42  6.39  3.89
12523   1.01      Ideal     E     SI1   61.8   57.0   5262  6.39  6.49  3.98
53476   0.71  Very Good     D     SI1   63.2   58.0   2681  5.65  5.68  3.58
41432   0.45       Fair     H    VVS2   65.8   56.0   1227  4.82  4.70  3.13
10867   1.23    Premium     F     SI2   61.7   58.0   4876  6.85  6.95  4.26
41100   0.50       Good     I     VS1   61.2   61.0   1193  5.03  5.06  3.09

In [311]:
df >> mask(X.cut == 'Ideal') >> head()

    carat    cut color clarity  depth  table  price     x     y     z
0    0.23  Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
11   0.23  Ideal     J     VS1   62.8   56.0    340  3.93  3.90  2.46
13   0.31  Ideal     J     SI2   62.2   54.0    344  4.35  4.37  2.71
16   0.30  Ideal     I     SI2   62.0   54.0    348  4.31  4.34  2.68
39   0.33  Ideal     I     SI2   61.8   55.0    403  4.49  4.51  2.78

In [312]:
df >> mask(X.cut == 'Ideal', X.color == 'E', X.table < 55, X.price < 500)

       carat    cut color clarity  depth  table  price     x     y     z
26683   0.33  Ideal     E     SI2   62.2   54.0    427  4.44  4.46  2.77
32297   0.34  Ideal     E     SI2   62.4   54.0    454  4.49  4.52  2.81
40928   0.30  Ideal     E     SI1   61.6   54.0    499  4.32  4.35  2.67
50623   0.30  Ideal     E     SI2   62.1   54.0    401  4.32  4.35  2.69
50625   0.30  Ideal     E     SI2   62.0   54.0    401  4.33  4.35  2.69

In [313]:
df >> mutate(x_plus = X.x + X.y) >> select(columns_from('x')) >> head()

      x     y     z  x_plus
0  3.95  3.98  2.43    7.93
1  3.89  3.84  2.31    7.73
2  4.05  4.07  2.31    8.12
3  4.20  4.23  2.63    8.43
4  4.34  4.35  2.75    8.69

In [314]:
df >> mutate(x_plus = X.x + X.y, y_div_z = (X.y / X.z)) >> select(columns_from('x')) >> head()

      x     y     z  x_plus   y_div_z
0  3.95  3.98  2.43    7.93  1.637860
1  3.89  3.84  2.31    7.73  1.662338
2  4.05  4.07  2.31    8.12  1.761905
3  4.20  4.23  2.63    8.43  1.608365
4  4.34  4.35  2.75    8.69  1.581818

In [315]:
df >> transmute(x_plus = X.x + X.y, y_div_z = (X.y / X.z)) >> head()

   x_plus   y_div_z
0    7.93  1.637860
1    7.73  1.662338
2    8.12  1.761905
3    8.43  1.608365
4    8.69  1.581818

In [316]:
df >> group_by(X.cut) >> arrange(X.price, ascending = True) >> ungroup() >> mask(X.carat < 0.23)

       carat        cut color clarity  depth  table  price     x     y     z
8       0.22       Fair     E     VS2   65.1   61.0    337  3.87  3.78  2.49
31595   0.20      Ideal     E     VS2   59.7   55.0    367  3.86  3.84  2.30
31597   0.20      Ideal     D     VS2   61.5   57.0    367  3.81  3.77  2.33
31599   0.20      Ideal     E     VS2   62.2   57.0    367  3.76  3.73  2.33
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
12      0.22    Premium     F     SI1   60.4   61.0    342  3.88  3.84  2.33
14      0.20    Premium     E     SI2   60.2   62.0    345  3.79  3.75  2.27
31591   0.20    Premium     E     VS2   59.8   62.0    367  3.79  3.77  2.26
31601   0.20    Premium     D     VS2   61.7   60.0    367  3.77  3.72  2.31
31592   0.20    Premium     E     VS2   59.0   60.0    367  3.81  3.78  2.24
31593   0.20    Premium     E     VS2   61.1   59.0    367  3.81  3.78  2.32
31600   0.20    Premium     D     VS2   62.3   60.0    367  3.73  3.68  2.31
31596   0.20    Premium     F     VS2   62.6   59.0    367  3.73  3.71  2.33
31594   0.20    Premium     E     VS2   59.7   62.0    367  3.84  3.80  2.28
38279   0.21    Premium     D     VS2   58.3   59.0    386  3.96  3.93  2.30
38278   0.21    Premium     D     VS2   59.1   62.0    386  3.89  3.86  2.29
38277   0.21    Premium     D     VS2   60.6   60.0    386  3.85  3.81  2.32
38276   0.21    Premium     D     VS2   61.6   59.0    386  3.82  3.78  2.34
38275   0.21    Premium     E     VS2   59.6   56.0    386  3.93  3.89  2.33
38274   0.21    Premium     E     VS2   60.5   59.0    386  3.87  3.83  2.33
43989   0.21    Premium     E     SI2   61.9   56.0    394  3.84  3.82  2.37
53      0.22    Premium     E     VS2   61.6   58.0    404  3.93  3.89  2.41
54      0.22    Premium     D     VS2   59.3   62.0    404  3.91  3.88  2.31
34611   0.22    Premium     F     SI1   61.7   60.0    470  3.90  3.85  2.39
31598   0.20  Very Good     E     VS2   63.4   59.0    367  3.74  3.71  2.36
38273   0.21  Very Good     E     VS2   63.2   54.0    386  3.82  3.78  2.40

In [317]:
df >> summarize(price_mean = X.price.mean(), price_sd =  X.price.std())

    price_mean     price_sd
0  3932.799722  3989.439738

In [318]:
df >> group_by('cut') >> summarize(price_mean = X.price.mean(), price_sd =  X.price.std())

         cut   price_mean     price_sd
0       Fair  4358.757764  3560.386612
1       Good  3928.864452  3681.589584
2      Ideal  3457.541970  3808.401172
3    Premium  4584.257704  4349.204961
4  Very Good  3981.759891  3935.862161

## Data İmport

In [319]:
pwd

'C:\\Users\\berka\\Google Drive\\code\\Data-Science---Artificial-Intelligence\\1. Python\\2. Dr. M. Vahit Keskin\\3. Pandas Basics'

In [320]:
# pd.read_csv('data')